app/views/comments/_edit_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user %>
    <%= form.collection_select :user_id, User.all, :id, :name, prompt: true %>