app/views/users/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
        <li>Posts:</li>
        <% user.posts&.each do |post| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
              <li>Comments:</li>
              <% post.comments&.each do |comment| %>