app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    #@post = Post.find(params[:post_id])
    #@comment = @post.comments.find(params[:id])
    @comment = Comment.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "this is a post"], ["body", "from user3 to user1"], ["post_id", 4], ["created_at", "2023-11-04 18:50:36.407756"], ["updated_at", "2023-11-04 18:50:36.407756"], ["user_id", 3]]
INSERT INTO "comments" ("title", "body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "LESGO"], ["body", "it works"], ["post_id", 1], ["created_at", "2023-11-04 18:44:27.710318"], ["updated_at", "2023-11-04 18:44:27.710318"], ["user_id", 3]]
UPDATE "comments" SET "updated_at" = ?, "user_id" = ? WHERE "comments"."id" = ?  [["updated_at", "2023-11-04 18:50:36.504289"], ["user_id", 1], ["id", 5]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    #@comment.user_id = @post.user_id
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "comments" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["title", "tested"], ["body", "asfd"], ["updated_at", "2023-11-06 03:46:11.291150"], ["id", 2]]
UPDATE "posts" SET "title" = ?, "body" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "this is a post"], ["body", "from user3 to user1"], ["user_id", 3], ["updated_at", "2023-11-06 03:40:35.737589"], ["id", 4]]
---
  def update
    @comment = Comment.find(params[:id])
    @post = @comment.post

    if @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @post = @comment.post
    @comment.destroy