app/controllers/posts_controller.rb

  def create
    @user = User.find(params[:user_id])
    @post = @user.posts.create(post_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test1"], ["body", "sfda"], ["user_id", 3], ["created_at", "2023-11-04 18:26:07.386531"], ["updated_at", "2023-11-04 18:26:07.386531"]]

  def update
    @post = Post.find(params[:id])
    @user = @post.user

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "with crud on rails"], ["updated_at", "2023-11-06 03:47:22.880049"], ["id", 5]]