app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "user1"], ["created_at", "2023-11-04 18:25:38.423277"], ["updated_at", "2023-11-04 18:25:38.423277"]]
---
  def create
    @user = User.new(user_params)

    if @user.save